ext_b24/DataProcessors/алсавб24_ВыгрузкаКонтрагентов_Адреса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>алсавб24_ВыгрузкаКонтрагентов_Адреса</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ext_b24/InformationRegisters/алсавб24_СопоставлениеОбъектовБ24.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>алсавб24_СопоставлениеОбъектовБ24</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объект1С</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>TITLE</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ENTITY_ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ENTITY_TYPE_ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_b24/DataProcessors/алсавб24_ВыгрузкаКонтрагентов_Адреса/Ext/ManagerModule.bsl
///************
// Выгрузка адресов контрагента (crm.address)
//
///************

// Типы адресов для Bitrix24 CRM (https://apidocs.bitrix24.ru/api-reference/crm/auxiliary/enum/crm-enum-address-type.html)
Функция ТипАдресаФактический() Экспорт
	Возврат 1;
КонецФункции

Функция ТипАдресаЮридический() Экспорт
	Возврат 6;
КонецФункции

Функция ТипАдресаДоставки() Экспорт
	Возврат 3;
КонецФункции

///
/// // Создать адреса для контрагента
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - ссылка на контрагента
//  IDКомпанииБ24 - Число - ID компании в Б24
//
Процедура СоздатьАдресаКонтрагента(Контрагент, IDКомпанииБ24) Экспорт

	// Создаем адреса (фактический и юридический)
	КонтактнаяИнформация = Контрагент.КонтактнаяИнформация;
	Для Каждого СтрокаКИ Из КонтактнаяИнформация Цикл
		Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда

			ТипАдреса = 0;
			НаименованиеВида = "";

			Если СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
				ТипАдреса = ТипАдресаФактический();
				НаименованиеВида = "Фактический адрес";
			ИначеЕсли СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента Тогда
				ТипАдреса = ТипАдресаЮридический();
				НаименованиеВида = "Юридический адрес";
			КонецЕсли;

			Если ТипАдреса > 0 Тогда
				ПоляАдреса = Новый Структура;
				ПоляАдреса.Вставить("ENTITY_ID", IDКомпанииБ24);
				ПоляАдреса.Вставить("ENTITY_TYPE_ID", Обработки.алсавб24_api_CRM_Common.ENTITY_TYPE_ID_Компания());
				ПоляАдреса.Вставить("TYPE_ID", ТипАдреса);
				ПоляАдреса.Вставить("ADDRESS_1", СтрокаКИ.Представление);

				APIРезультат = Обработки.алсавб24_api_CRM_Адреса.crm_address_add(ПоляАдреса);

				Если APIРезультат.Свойство("result") Тогда
					IDАдреса = APIРезультат.result;
					// Регистрируем сопоставление адреса
					ЗарегистрироватьСопоставлениеАдреса(IDАдреса, Контрагент, НаименованиеВида + ": " + СтрокаКИ.Представление, ТипАдреса);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

///
/// // Обновить адреса для контрагента
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - ссылка на контрагента
//  IDКомпанииБ24 - Число - ID компании в Б24
//
Процедура ОбновитьАдресаКонтрагента(Контрагент, IDКомпанииБ24) Экспорт

	// Ищем существующие адреса
	APIРезультат = Обработки.алсавб24_api_CRM_Адреса.crm_address_list_by_entity(
		IDКомпанииБ24, Обработки.алсавб24_api_CRM_Common.ENTITY_TYPE_ID_Компания());

	КонтактнаяИнформация = Контрагент.КонтактнаяИнформация;

	// Обрабатываем каждый вид адреса
	ВидыАдресов = Новый Массив;
	ВидыАдресов.Добавить(Новый Структура("Вид, ТипАдреса, Наименование", Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента, ТипАдресаФактический(), "Фактический адрес"));
	ВидыАдресов.Добавить(Новый Структура("Вид, ТипАдреса, Наименование", Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента, ТипАдресаЮридический(), "Юридический адрес"));

	Для Каждого ВидАдреса Из ВидыАдресов Цикл
		АдресНайденВКИ = Ложь;

		// Ищем адрес в контактной информации
		Для Каждого СтрокаКИ Из КонтактнаяИнформация Цикл
			Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес И СтрокаКИ.Вид = ВидАдреса.Вид Тогда

				АдресНайденВКИ = Истина;
				АдресНайденВБ24 = Ложь;

				// Ищем существующий адрес в Б24
				Для Каждого Адрес Из APIРезультат.result Цикл
					Если Число(Адрес.Получить("TYPE_ID")) = ВидАдреса.ТипАдреса Тогда
						// Обновляем существующий адрес
						ПоляАдреса = Новый Структура;
						ПоляАдреса.Вставить("ADDRESS_1", СтрокаКИ.Представление);

						Обработки.алсавб24_api_CRM_Адреса.crm_address_update(Адрес.Получить("ID"), ПоляАдреса);
						АдресНайденВБ24 = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;

				// Если не найден в Б24, создаем новый
				Если Не АдресНайденВБ24 Тогда
					ПоляАдреса = Новый Структура;
					ПоляАдреса.Вставить("ENTITY_ID", IDКомпанииБ24);
					ПоляАдреса.Вставить("ENTITY_TYPE_ID", Обработки.алсавб24_api_CRM_Common.ENTITY_TYPE_ID_Компания());
					ПоляАдреса.Вставить("TYPE_ID", ВидАдреса.ТипАдреса);
					ПоляАдреса.Вставить("ADDRESS_1", СтрокаКИ.Представление);

					APIРезультатСоздания = Обработки.алсавб24_api_CRM_Адреса.crm_address_add(ПоляАдреса);

					Если APIРезультатСоздания.Свойство("result") Тогда
						IDАдреса = APIРезультатСоздания.result;
						ЗарегистрироватьСопоставлениеАдреса(IDАдреса, Контрагент, ВидАдреса.Наименование + ": " + СтрокаКИ.Представление, ВидАдреса.ТипАдреса);
					КонецЕсли;
				КонецЕсли;

				Прервать; // Нашли адрес в КИ, выходим из цикла по КИ
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

///
/// // Зарегистрировать сопоставление адреса
// Параметры:
//  IDАдреса - Число - ID адреса в Б24
//  Объект1С - ЛюбаяСсылка - ссылка на объект 1С
//  Наименование - Строка - наименование для TITLE
//  ТипАдреса - Число - тип адреса в Б24
//
Процедура ЗарегистрироватьСопоставлениеАдреса(IDАдреса, Объект1С, Наименование, ТипАдреса = 0) Экспорт

	НаборЗаписей = РегистрыСведений.алсавб24_СопоставлениеОбъектовБ24.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ENTITY_ID.Установить(IDАдреса);

	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ENTITY_ID = IDАдреса;
	НоваяЗапись.ENTITY_TYPE_ID = Обработки.алсавб24_api_CRM_Common.ENTITY_TYPE_ID_Адреса();
	НоваяЗапись.TYPE_ID = ТипАдреса;
	НоваяЗапись.Объект1С = Объект1С;
	НоваяЗапись.TITLE = Наименование;

	НаборЗаписей.Записать();

КонецПроцедуры
